src/main/webapp/test.html


<div class=\"card-body\">
	<form role=\ "form\" action=\
		"/mqttmanagment/home/pushbutton/CAMBIARSONOFF\" method=\ "post\" id=\
		"pushCAMBIARSONOFF\" enctype=\"multipart/form-data\">
		<h4 id=\ "sonoffname\" class=\"smallfont-weight-bold\">
			Timer<span class=\"float-right\">0</span>
		</h4>
		<div class=\"progressmb-4\">
			<div class=\ "progress-bar\" id=\ "sonofftimer\" role=\
				"progressbar\"	aria-valuemin=\ "0\" aria-valuemax=\ "60\" style="""width: 50%;\">
			</div>
		</div>
		<p></p>
		<b> Status Power
			<div class=\"float-right\">
				<input id=\ "sonoffpowerCAMBIARSONOFF\" type=\
					"checkbox\"	data-toggle=\ "toggle\" data-style=\ "slow\" onclick=\"EnviarSonoff('mqtt.coiaca.com','8080','mqttusr','mqttpwd','CAMBIARSONOFF')\">
			</div>
		</b><input type=\ "hidden\" name=\ "sonoffpower\" id=\ "sonoffpower1\" />
		<p></p>
	</form>
	<form role=\ "form\" action=\
		"/mqttmanagment/home/settimerString/CAMBIARSONOFF\" method=\
		"get\" enctype=\"multipart/form-data\">
		<button type=\ "submit\" class=\ "btnbtn-primarybtn-sm\"><i class=\"fal fa-stopwatch\" title=\"Set Timer String\"></i></button>
	</form>

</div>



<div class=\"card-body\"> <h4 id=\"sonoffname\" class=\"small font-weight-bold\">Timer<span class=\"float-right\">0</span></h4><div class=\"progres smb-4\">	<div class=\ "progress-bar\" id=\ "sonofftimer\" role=\"progressbar\"	aria-valuemin=\ "0\" aria-valuemax=\ "60\" style="""width: 50%;\">	</div></div><p></p>	<b> Status Power<div class=\"float-right\">	<input id=\ "sonoffpowerCAMBIARSONOFF\" type=\"checkbox\"	data-toggle=\ "toggle\" data-style=\ "slow\" onchange=\"EnviarSonoff('mqtt.coiaca.com','8080','mqttusr','mqttpwd','CAMBIARSONOFF')\"></div></b><input type=\ "hidden\" name=\ "sonoffpower\" id=\ "sonoffpower1\" />	<p></p>	<button type=\ "submit\" class=\"btn btn-primary btn-sm float-left\" onclick=\"EnviarSonoffSimulatePushbutton('mqtt.coiaca.com','8080','mqttusr','mqttpwd','CAMBIARSONOFF')\">Simulated push button</button><form role=\ "form\" action=\"/mqttmanagment/home/settimerString/CAMBIARSONOFF\" method=\"get\" enctype=\"multipart/form-data\"><button type=\"submit\" class=\"btn btn-lg float-right\" style=\"background: transparent;  border: transparent;\"><i class=\"fas fa-stopwatch\"  title=\"Set Timer String\"></i></button>	</form></div>




<?xml version="1.0" encoding="UTF-8"?>
<S:Envelope xmlns:S="http://www.w3.org/2003/05/soap-envelope">
	<S:Header>
		<wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://gsma.com/ES3/PlatformManagementCallBack/ES3-DeleteISDP</wsa:Action>
		<wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">gemalto-smdp/a30bac57-e3cd-423c-b1a3-adada8fa7961?MessageDate=2019-01-25T23:16:23Z</wsa:MessageID>
		<wsa:RelatesTo xmlns:wsa="http://www.w3.org/2005/08/addressing">http://190.247.133.76:8080/DPvdfpoc</wsa:RelatesTo>
		<wsa:From xmlns:wsa="http://www.w3.org/2005/08/addressing">
			<wsa:Address>https://dctwebvlp63-vip.gemalto.com:17903/ES3/ES3SmSrService</wsa:Address>
		</wsa:From>
		<wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">http://190.247.133.76:8080/DPvdfpoc?EntityId=1.3.6.1.4.1.50201</wsa:To>
	</S:Header>
	<S:Body>
		<rps3:ES3-DeleteISDPResponse
			xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
			xmlns:rps3="http://namespaces.gsma.org/esim-messaging/3"
			xmlns:wsa="http://www.w3.org/2005/08/addressing">
			<rps3:ProcessingStart>2019-01-25T23:16:19Z</rps3:ProcessingStart>
			<rps3:ProcessingEnd>2019-01-25T23:16:23Z</rps3:ProcessingEnd>
			<rps3:FunctionExecutionStatus>
				<rps3:Status>FAILED</rps3:Status>
				<rps3:StatusCodeData>
					<rps3:Subject>8.4</rps3:Subject>
					<rps3:Reason>5.1</rps3:Reason>
					<rps3:SubjectIdentifier>ISD-R=A0000005591010FFFFFFFF8900000100</rps3:SubjectIdentifier>
					<rps3:Message>'0400':DeleteISDP, The use case was failed at 'profile disabling' step. Detail: Delivery Status failed. DS code was [709]</rps3:Message>
				</rps3:StatusCodeData>
			</rps3:FunctionExecutionStatus>
		</rps3:ES3-DeleteISDPResponse>
	</S:Body>
</S:Envelope>



<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
	<soap:Header>
		<ns2:From xmlns="http://namespaces.gsma.org/esim-messaging/3"
			xmlns:ns2="http://www.w3.org/2005/08/addressing"
			xmlns:ns3="http://www.w3.org/2000/09/xmldsig#">
			<ns2:Address>http://190.247.133.76:8080/DPvdfpoc?EntityId=1.3.6.1.4.1.50201</ns2:Address>
		</ns2:From>
		<ns2:To xmlns="http://namespaces.gsma.org/esim-messaging/3"
			xmlns:ns2="http://www.w3.org/2005/08/addressing"
			xmlns:ns3="http://www.w3.org/2000/09/xmldsig#">https://dctwebvlp63-vip.gemalto.com:17903/ES3/ES3SmSrService</ns2:To>
		<ns2:MessageID xmlns="http://namespaces.gsma.org/esim-messaging/3"
			xmlns:ns2="http://www.w3.org/2005/08/addressing"
			xmlns:ns3="http://www.w3.org/2000/09/xmldsig#">http://190.247.133.76:8080/DPvdfpoc?MessageDate=2019-01-25T23:16:18Z</ns2:MessageID>
		<ns2:Action xmlns="http://namespaces.gsma.org/esim-messaging/3"
			xmlns:ns2="http://www.w3.org/2005/08/addressing"
			xmlns:ns3="http://www.w3.org/2000/09/xmldsig#">http://gsma.com/ES3/PlatformManagement/ES3-DeleteISDP</ns2:Action>
		<ns2:ReplyTo xmlns="http://namespaces.gsma.org/esim-messaging/3"
			xmlns:ns2="http://www.w3.org/2005/08/addressing"
			xmlns:ns3="http://www.w3.org/2000/09/xmldsig#">
			<ns2:Address>http://190.247.133.76:8080/DPvdfpoc/es3</ns2:Address>
		</ns2:ReplyTo>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsse:UsernameToken
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
				wsu:Id="921105694">
				<wsse:Username>es3caller@VALIDDPLAB</wsse:Username>
				<wsse:Password
					Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">awV70BQK645xgEt32okl518rZ</wsse:Password>
				<wsse:Nonce
					EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">GTgjQA==</wsse:Nonce>
				<wsu:Created>2019-01-25T23:16:25Z</wsu:Created>
			</wsse:UsernameToken>
			<wsu:Timestamp
				xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
				<wsu:Created>2019-01-25T23:16:25Z</wsu:Created>
				<wsu:Expires>2019-01-25T23:21:25Z</wsu:Expires>
			</wsu:Timestamp>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<ES3-DeleteISDPRequest
			xmlns="http://namespaces.gsma.org/esim-messaging/3"
			xmlns:ns2="http://www.w3.org/2005/08/addressing"
			xmlns:ns3="http://www.w3.org/2000/09/xmldsig#">
		<FunctionCallIdentifier>EAA7D73E89DD54D06FEBC0BB9180C94C</FunctionCallIdentifier>
		<ValidityPeriod>10000</ValidityPeriod>
		<Eid>89033023312150000000000308808531</Eid>
		<Iccid>8942306000042528709</Iccid></ES3-DeleteISDPRequest>
	</soap:Body>
</soap:Envelope>




<div class="card-body">
	<h4 id="sonoffname" class="small font-weight-bold">
		Timer<span class="float-right">0</span>
	</h4>
	<div class="progress mb-4">
		<div class="progress-bar" id="sonofftimer" role="progressbar"
			aria-valuemin="0" aria-valuemax="60" style="width: 50%;"></div>
	</div>
	<p></p>
	<b> Switch One
		<div class="float-right">
			<input id="sonoffpowerCAMBIARSONOFF" type="checkbox"
				data-toggle="toggle" data-style="slow"
				onchange="EnviarSonoff('HOSTSONOFF','PORTSONOFF','USERSONOFF','PASSSONOFF','TOPICSONOFF','switchone','CAMBIARSONOFF')">
		</div>
	</b><input type="hidden" name="sonoffpower" id="sonoffpower1" />
	<p></p>
	<b> Switch Two
		<div class="float-right">
			<input id="sonoffpowerCAMBIARSONOFF" type="checkbox"
				data-toggle="toggle" data-style="slow"
				onchange="EnviarSonoff('HOSTSONOFF','PORTSONOFF','USERSONOFF','PASSSONOFF','TOPICSONOFF','switchtwo','CAMBIARSONOFF')">
		</div>
	</b><input type="hidden" name="sonoffpower" id="sonoffpower1" />
	<p></p>
	<button type="submit" class="btn btn-primary btn-sm float-left"
		onclick="EnviarSonoffSimulatePushbutton('HOSTSONOFF','PORTSONOFF','USERSONOFF','PASSSONOFF','TOPICSONOFF','switchtwo','CAMBIARSONOFF')">Simulated
		push button</button>
	<form role="form"
		action="/mqttmanagment/home/settimerString/CAMBIARSONOFF"
		method="get" enctype="multipart/form-data">
		<button type="submit" class="btn btn-lg float-right"
			style="background: transparent; border: transparent;">
			<i class="fas fa-stopwatch" title="Set Timer String"></i>
		</button>
	</form>
</div>











